/*有1元，5元，10元，50元和100元钞票各c1,c2,c3,c4,c5。
现要这些钞票支付123456元，则最少需要多少张钞票?
具体1元,5元,10元,50元,100元各自的张数为:
100000,10000,1000,100,10*/
#include<stdio.h>
int main()
{
	int c1, c2, c3, c4, c5;
	int n = 123456;
	if(100 * 10 < n)
	{
		c1 = 10;
		n -= 100 * 10;
	}
	else
	{
		c1 = n / 100;
		n %= 100;
	}
	
	if(50 * 100 < n)
	{
		c2 = 100;
		n -= 100 * 50;
	}
	else
	{
		c2 = n / 50;
		n %= 50;
	}
	if(10 * 1000 < n)
	{
		c3 = 1000;
		n -= 1000 * 10;
	}
	else
	{
		c3 = n / 10;
		n %= 10;
	}
	if(5 * 10000 < n)
	{
		c4 = 10000;
		n -= 10000 * 5;
	}
	else
	{
		c4 = n / 5;
		n %= 5;
	}
	if(100000 < n)
	{
		c5 = 100000;
		n -= 10000;
	}
	else
	{
		c5 = n;
	}
	printf("最少张数为%d张，\n100元%d张，50元%d张，10元%d张，5元%d张，1元%d张\n", c1 + c2 + c3 + c4 + c5,
	c1, c2, c3, c4, c5 );
	
	return 0;
}
